# -*- coding: utf-8 -*-
"""task_1.1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1GBGbkEO4zu66woEY5g_vMFwk-cQ2zfUe
"""

print(round(3.1415926*(36**2),4))

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'

# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.

print (my_favorite_songs[0:14])
print (my_favorite_songs[-13:-1])
print (my_favorite_songs[16:30])
print (my_favorite_songs[-26:-16])