# -*- coding: utf-8 -*-
"""task_1.2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1sZPYn_TJzEI18mO68rZpdhE0O41FvmXm
"""

# Пункт A. 
# Приведем плейлист песен в виде списка списков
# Список my_favorite_songs содержит список названий и длительности каждого трека
# Выведите общее время звучания трех случайных песен в формате
# Три песни звучат ХХХ минут

my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]

import random
time_1=0
lst = random.sample(my_favorite_songs,3)
for i in lst:
  time_1 += i[1]

print(lst)
print(f'Три песни звучат {time_1} минут')

#или (пишу для себя)
print('Три песни звучат {} минут'.format(time_1))
#или (пишу для себя)
print('Три песни звучат',str(time_1), 'минут')

# Пункт B. 
# Есть словарь песен 
# Распечатайте общее время звучания трех случайных песен
# Вывод: Три песни звучат ХХХ минут.

my_favorite_songs_dict = {
    'Waste a Moment': 3.03,
    'New Salvation': 4.02,
    'Staying\' Alive': 3.40,
    'Out of Touch': 3.03,
    'A Sorta Fairytale': 5.28,
    'Easy': 4.15,
    'Beautiful Day': 4.04,
    'Nowhere to Run': 2.58,
    'In This World': 4.02,
}

import random
time_2=0
my_favorite_songs_lst=list(my_favorite_songs_dict.items())
lst = random.sample(my_favorite_songs_lst,3)
for i in lst:
  time_2 += i[1]

print(lst)
print(f'Три песни звучат {time_2} минут')

# Дополнительно для пунктов A и B
# Пункт C.
# Сгенерируйте случайные песни с помощью модуля random
# import random

Songs = len(my_favorite_songs)
Random_lst = random.sample(my_favorite_songs,Songs)
print('случайные песни', Random_lst)

# Дополнительно 
# Пункт D.
# Переведите минуты и секунды в формат времени. Используйте модуль datetime 

#не совсем получилось
import datetime
sec = round(time_1,2) * 60
print(str(datetime.timedelta(seconds=sec)))